Revit 2026 API

# TableCellStyleBackgroundColor Property

---

The background color of this cell in the grid view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Color BackgroundColor { get; set; }
```
```vb
Public Property BackgroundColor As Color
	Get
	Set
```
```cpp
public:
property Color^ BackgroundColor {
	Color^ get ();
	void set (Color^ value);
}
```
```fsharp
member BackgroundColor : Color with get, set
```

#### Property Value

Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

TableCellStyle Class

Autodesk.Revit.DB Namespace